## :bangbang: Acceptance Test failed 

=== RUN   TestAccDisksDataSource
    vm_disks_datasource_test.go:72: Step 1/1 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
         <= read (data resources)
        
        Terraform will perform the following actions:
        
          # data.cloudavenue_vm_disks.example will be read during apply
          # (depends on a resource or a module with changes pending)
         <= data "cloudavenue_vm_disks" "example" {
              + disks   = [
                ] -> (known after apply)
              + id      = (known after apply)
              + vapp_id = "urn:vcloud:vapp:fb37dbe9-2d0d-42fc-9bd1-4ae0983e042e"
              + vdc     = (known after apply)
              + vm_id   = "urn:vcloud:vm:e7d67497-4a79-4c30-bf1b-b0d1aa681169"
            }
        
          # cloudavenue_vm.example will be updated in-place
          ~ resource "cloudavenue_vm" "example" {
                id        = "urn:vcloud:vm:e7d67497-4a79-4c30-bf1b-b0d1aa681169"
                name      = "example-vm"
              ~ state     = {
                  ~ status   = "POWERED_ON" -> (known after apply)
                    # (1 unchanged attribute hidden)
                }
                # (6 unchanged attributes hidden)
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- FAIL: TestAccDisksDataSource (226.78s)
FAIL
FAIL	github.com/orange-cloudavenue/terraform-provider-cloudavenue/internal/tests/vm	226.797s
FAIL
